[Akimbo X2SoldierClassTemplate]
+DisplayName="Akimbo"
+ClassSummary="Akimbo makes use of dual single-handed firearms to engage enemies at close and medium range, and can specialize in gunplay and avoidance, or surprising enemies with a barrage of melee attacks."
+LeftAbilityTreeTitle="Gun Fu"
+RightAbilityTreeTitle="Scrapper"
AbilityTreeTitles[0]="Gun Fu"
AbilityTreeTitles[1]="Scrapper"
AbilityTreeTitles[2]="Supplemental"


+RandomNickNames[0]="Judge"
+RandomNickNames[1]="Maverick"
+RandomNickNames[2]="Stuntmaster"
+RandomNickNames[3]="Trickster"
+RandomNickNames[4]="Ace"
+RandomNickNames[5]="Texas"
+RandomNickNames[6]="Fast"
+RandomNickNames[7]="Lucky"
+RandomNickNames[8]="Double"
+RandomNickNames[9]="Stand Off"
+RandomNickNames[10]="Cowboy"
+RandomNickNames[11]="Trigger"
+RandomNickNames[12]="Macedonian"
+RandomNickNames[13]="Wick"
+RandomNickNames[14]="Gunfall"
+RandomNickNames[15]="Gun Show"
+RandomNickNames[16]="Cleric"
+RandomNickNames[17]="Striker"
+RandomNickNames[18]="Reckless"
+RandomNickNames[19]="Magnus"
+RandomNickNames[20]="Rebel"
+RandomNickNames[21]="Sunder"
+RandomNickNames[22]="Impact"
+RandomNickNames[23]="Crow"

;+RandomNickNames[19]="Forty Seven"
;+RandomNickNames[11]="High Noon"
;+RandomNickNames[9]="Two Guns"
;+RandomNickNames[17]="Wild West"
;+RandomNickNames[14]="Bullet Wizard"
;+RandomNickNames[0]="Shooter"
;+RandomNickNames[2]="Six Gun"
;+RandomNickNames[3]="Ranger"
;+RandomNickNames[4]="Buffalo"
;+RandomNickNames[13]="Mason"
;+RandomNickNames[15]="Smith'n'Wesson"

;//SQUADDIE PERKS
;///LocHelpText - shown in tactical under ability name
;///LocLongDescription - shown in strategic at the bottom, and on mouseover on corner icon in tactical

[DP_DualPistols X2AbilityTemplate]
LocFriendlyName="Dual Weapon Specialization"
LocLongDescription="This soldier has undergone special training and does not suffer Aim penalties while using dual firearms."
LocPromotionPopupText="<Bullet/>Most dual wielded attacks will attack from both weapons separately. Each shot will use a separate aim roll, and will be affected by Upgrades applied only to that specific weapon."

;//GUN FU PERKS

[DP_TrickShot X2AbilityTemplate]
LocFriendlyName="Trick Shot"
LocLongDescription="A special dual pistol shot against a target in cover. Ignores cover bonuses and has +40% Crit Chance, but deals damage only from the mainhand weapon."
LocHelpText="Deliver a flanking shot from the mainhand weapon against a target in cover."
LocFlyOverText="Trick Shot" 
LocPromotionPopupText="<Bullet/> Requires dual pistols. <br/><Bullet/> Can be activated only against enemies in Cover. <br/><Bullet/> Ignores Defense bonuses from cover.<br/><Bullet/> Deals damage only from the mainahnd weapon.<br/><Bullet/> This ability benefits from Hunter's Instinct and provides the same Crit Chance as an actual flanking shot would, but will not benefit from other flanking bonuses. <br/><Bullet/> No cooldown."

[DP_BulletTime X2AbilityTemplate]
LocFriendlyName="Bullet Time"
LocLongDescription="Pistol Shot, Trick Shot, Leg Shot, Checkmate, Unload and Fan Fire no longer end turn."
LocFlyOverText="Bullet Time"
LocPromotionPopupText="<Bullet/> Normally Akimbo cannot get Fan Fire, this is for the purposes of compatibility with Musashi's RPG Overhaul."

[DP_GunKata X2AbilityTemplate]
LocFriendlyName="Gun Kata"
LocLongDescription="Overwatch grants an additional Overwatch Action Point. Overwatch Action Points can now be used to avoid enemy attacks."
LocHelpText="Overwatch grants an additional Overwatch Action Point. Overwatch Action Points can now be used to avoid enemy attacks."
LocFlyOverText="Gun Kata" 
LocPromotionPopupText="<Bullet/> While on Overwatch, Overwatch Action Points can be used to completely avoid enemy attacks. <Bullet/><br/> The Overwatch Action Point Cost is not applied if the attack would have missed anyway. <br/><Bullet/>Gun Kata effects apply to Overwatch Action Points granted by Guardian, Threat Assessment and other similar perks."

[DP_SpinningReload_Passive X2AbilityTemplate]
LocFriendlyName="Spinning Reload"
LocLongDescription="Reloading your weapon grants an Overwatch Action Point. Additionally, this ability allows the soldier to automatically reload during enemy turn using Overwatch Action Points."
LocHelpText="Reload automatically at the cost of Overwatch Action Points."
LocPromotionPopupText="<Bullet/> Use Spinning Reload during your turns to gain a \"free\" Overwatch Action Point. <br/><Bullet/> Alternatively, Spinning Reload will trigger automatically during enemy turns if the soldier runs out of ammo, and they still have at least one Overwatch Action Point remaining. <br/><Bullet/> If at the start of your next turn the soldier still has at least one Overwatch Action Point, they will reload even if they still have some ammo remaining, just so the Overwatch Action Point doesn't go to waste.<br/><Bullet/> If Overwatching with the reloaded weapon requires more than 1 action point, Pistol Overwatch will be used instead." 
LocFlyOverText="Spinning Reload" 

[DP_SpinningReload_Reactive X2AbilityTemplate]
LocFriendlyName="Spinning Reload"
LocLongDescription="Reloading your weapon grants an Overwatch Action Point. Additionally, this ability allows the soldier to automatically reload during enemy turn using Overwatch Action Points."
LocHelpText="Reload automatically at the cost of Overwatch Action Points."
LocFlyOverText="Spinning Reload" 

[DP_SpinningReload_EOT X2AbilityTemplate]
LocFriendlyName="Spinning Reload"
LocLongDescription="Reloading your weapon grants an Overwatch Action Point. Additionally, this ability allows the soldier to automatically reload during enemy turn using Overwatch Action Points."
LocHelpText="Reload automatically at the cost of Overwatch Action Points."
LocFlyOverText="Spinning Reload" 

[DP_Quicksilver X2AbilityTemplate]
LocFriendlyName="Quicksilver"
LocLongDescription="Overwatch no longer end turn. Additionally, reaction shots have +20 Aim."
LocHelpText="Overwatch no longer end turn. Additionally, reaction shots have +20 Aim."
LocPromotionPopupText="<Bullet/> This ability makes it possible to activate Overwatch several times per turn, gaining additional Overwatch Action Points with each activation. <br/><Bullet/> Actual Ability Cost is not affected. E.g. Sniper Rifle Overwatch will still require two Action Points to activate."
LocFlyOverText="Quicksilver" 

[DP_Unload X2AbilityTemplate]
LocFriendlyName="Unload"
LocLongDescription="Fire each weapon 3 times at a single target. Costs 3 ammo, 3 turn cooldown. This ability suffers a -20 Aim penalty and cannot crit."
LocHelpText="Fire each weapon 3 times at a single target. 3 turn cooldown."
LocFlyOverText="Unload"

;//SCRAPPER PERKS

[DP_PistolWhip X2AbilityTemplate]
LocFriendlyName="Pistol Whip"
LocLongDescription="Move to an enemy and strike with both weapons, dealing normal damage."
LocHelpText="Move to an enemy and strike with both weapons."
LocFlyOverText="Pistol Whip"
LocPromotionPopupText="<Bullet/>Pistol Whip deals normal weapon damage, but it does not gain a critical chance bonus for flanking or bonus effects from special ammo.<br/><Bullet/>Each weapon strike uses a separate aim roll."

[DP_BonusMeleeAim X2AbilityTemplate]
LocFriendlyName="Trigger Guard"
LocLongDescription="Gain passive +20 Aim bonus to ALL melee attacks while dual wielding firearms. Pistol Whip no longer ends turn if the enemy is already within melee range."
LocHelpText="Gain passive +20 Aim bonus to ALL melee attacks while dual wielding firearms. Pistol Whip no longer ends turn if the enemy is already within melee range."

[DP_TakeInitiative X2AbilityTemplate]
LocFriendlyName="Take Initiative"
LocLongDescription="After attacking an enemy with Pistol Whip, immediately trigger an additional dual melee reaction attack against every enemy in melee range, including the original target."
LocFlyOverText="Take Initiative"
LocPromotionPopupText="<Bullet/> Each enemy can trigger one dual melee attack from Take Initiative or CQC Supremacy per turn. <br/><Bullet/> This limit resets at the end of your turn and at the end of enemy turn.<br/><Bullet/> These attacks count as reaction attacks and will have aim penalties."

[DP_CQCSupremacy X2AbilityTemplate]
LocFriendlyName="CQC Supremacy"
LocLongDescription="Free dual melee attacks against enemies moving or attempting action in melee range."
LocFlyOverText="CQC Supremacy"
LocPromotionPopupText="<Bullet/> Each enemy can trigger one dual melee attack from CQC Supremacy or Take Initiative per turn. <br/><Bullet/> This limit resets at the end of your turn and at the end of enemy turn."

[DP_ElectrifiedSpikes X2AbilityTemplate]
LocFriendlyName="Electrified Spikes"
LocLongDescription="Repeat melee attacks against the same target have a 75% chance to disorient. Melee attacks against disoriented enemies have a 75% chance to stun. Additionally, melee attacks against disoriented or stunned enemies will Shred 1 armor for each hit."
LocFlyOverText="Electrified Spikes"
LocPromotionPopupText="<Bullet/>This effect is applied to the secondary attack of the Pistol Whip.<br/><Bullet/>If you're using this ability with Musashi's RPG Overhaul, then be aware it works ONLY with Akimbo's melee attacks."

[DP_Checkmate X2AbilityTemplate]
LocFriendlyName="Checkmate"
LocLongDescription="A special mainhand attack that deals 100% bonus damage (300% if using dual pistols) to a stunned, unconscious or panicked enemy at close range. Always hits and always crits." 
LocHelpText="A guaranteed crit mainhand attack that deals 100% bonus damage (300% if using dual pistols) to a stunned, unconscious or panicked enemy at close range."
LocFlyOverText="Checkmate"
LocPromotionPopupText="<Bullet/> Can be used only against stunned, unconscious or panicked enemies within 1 tile.<br/><Bullet/> Does not include movement.<br/><Bullet/> Checkmate always hits and always crits.<br/><Bullet/> Costs 1 ammo. No cooldown."

[DP_LimitBreak X2AbilityTemplate]
LocFriendlyName="Limit Break"
LocLongDescription="Allows the soldier to break the shackles of human mind and gain perfect control of the body. Gain unlimited actions until the end of turn. Each action after the 4th will make the soldier take immediate damage, equal to 10% of maximum Health. Each action after the 5th will have an increasing chance to render the soldier unconscious. While Limit Break is active, any damage taken from other sources is delayed until the beginning of next turn and amplified by 25%. Can be used once per mission."
LocHelpText="Gain unlimited actions until the end of turn. Prolonged use will damage the soldier and potentially render them unconscious. Damage from other sources is delayed by 1 turn and increased by 25%."
LocFlyOverText="Limit Break"
LocPromotionPopupText="<Bullet/>Limit Break requires at least 1 Action to activate, but it will consume all available Action Points.<br/><Bullet/>After activating Limit Break, the soldier will have unlimited actions until the end of turn. However, for each action after the 4th one, the soldier will immediately take damage equal to 10% of their maximum health.<br/><Bullet/>This self damage will cancel Overwatch.<br/><Bullet/>All damage from all other sources is delayed until the beginning of your next turn and amplified by 25%.<br/><Bullet/>If damage from an attack exceeds soldier's current health, they will still die.<br/><Bullet/>Taking more than 5 actions in a row will have a chance to knock the soldier unconscious. Chance to lose consciousness:<br/><Bullet/>6 Actions: 25%<br/><Bullet/>7 Actions: 50%<br/><Bullet/>8 Actions: 75%<br/><Bullet/>9 Actions: 90%<br/><Bullet/>10 Actions or more: 95%<br/><Bullet/>Note: Mindshield or other similar effects will prevent the soldier from falling Unconscious.<br/><Bullet/>If the soldier loses consciousness, and gets revived on the same turn, they will still be affected by Limit Break, and number of taken actions will NOT reset."

[DP_LimitBreak_SelfDamage X2AbilityTemplate]
LocFlyOverText="Limit Break"

;// SUPPLEMENTAL TREE

[DP_LegShot X2AbilityTemplate]
LocFriendlyName="Leg Shot"
LocLongDescription="A special dual pistol shot that will reduce enemy mobility, and potentially immobilize them. Deals half damage and cannot crit. Mobility reduction lasts 1 turn."
LocHelpText="A dual shot that potentially immobilizes the target for 1 turn. Deals half damage, cannot crit."
LocFlyOverText="Leg Shot"
LocPromotionPopupText="<Bullet/> Requires dual pistols. <br/><Bullet/> Each hit of this ability reduces enemy Mobility stat by 10. It will not prevent enemies from teleporting or using grapple.<br/><Bullet/> No cooldown."

[DP_DirtyKick X2AbilityTemplate]
LocFriendlyName="Dirty Kick"
LocLongDescription="Move to an enemy and kick them in a vulnerable spot. If hits, stuns for 3 actions."
LocHelpText="Move to an enemy and kick them in a vulnerable spot. If hits, stuns for 3 actions."
LocFlyOverText="Dirty Kick"
LocPromotionPopupText="<Bullet/>This ability includes movement and counts as a melee attack, but it does not deal any damage, even with Hunter's Instincts.<br/><Bullet/>Cannot be used against large or robotic enemies.<br/><Bullet/>If hits, stuns for 3 actions, meaning that most enemies will spend their next whole turn stunned, and they will have one action on a turn after that.<br/><Bullet/>Costs 1 action and doesn't end turn.<br/><Bullet/> 3 turn cooldown."

[DP_HuntersInstinct X2AbilityTemplate]
LocFriendlyName="Hunter's Instinct"
LocLongDescription="Increases ranged damage to flanked enemies by 1. Increases melee damage by 1."
LocFlyOverText="Hunter's Instinct"
LocPromotionPopupText="Bonus damage is applied to each shot and each melee strike. Affects Trick Shot."